EDT/УТ/src/Documents/СнятиеДоставокСПланирования_КУдалению/СнятиеДоставокСПланирования_КУдалению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СнятиеДоставокСПланирования_КУдалению</name>
  <attributes>
    <name>РежимСнятияСДоставки</name>
    <type>
      <types>EnumRef.РежимыОбработкиНеПриехавшиэхЗаказов003</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Накладная003</name>
    <type>
      <types>DocumentRef.Накладная003</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитКОтмене</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>BusinessProcessRef.новаМестнаяДоставка</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/ПараметрыЗагрузкиПриходныхНакладных/ПараметрыЗагрузкиПриходныхНакладных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыЗагрузкиПриходныхНакладных</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ЛимитКоличестваЗаказовВНакладнойКОтмене</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВременнойИнтервалМодификацииЗаказов</name>
    <type>
      <types>CatalogRef.ВременныеИнтервалы</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/СведенияДляОтменыАвтоматическогоУдаленияЗаказов003/СведенияДляОтменыАвтоматическогоУдаленияЗаказов003.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияДляОтменыАвтоматическогоУдаленияЗаказов003</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ДоставкиКУдалению003/ДоставкиКУдалению003.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоставкиКУдалению003</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаУдаления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/РежимыОбработкиНеПриехавшиэхЗаказов003/РежимыОбработкиНеПриехавшиэхЗаказов003.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыОбработкиНеПриехавшиэхЗаказов003</name>
  <enumValues>
    <name>УдалятьСДоставки</name>
  </enumValues>
  <enumValues>
    <name>ПереноситьДоставкуНаСледующийДень</name>
  </enumValues>
  <enumValues>
    <name>ОтложенноеУдаление</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/СнятиеДоставокСПланирования_КУдалению/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое обработчика.
	Возврат;
	Струк = Новый Структура;
	Струк.Вставить("Контрагент", Контрагент);
	Лимит = РегистрыСведений.ПараметрыЗагрузкиПриходныхНакладных.ПолучитьПоследнее(КонецДня(Дата), Струк).ЛимитКоличестваЗаказовВНакладнойКОтмене;
	
	Если Лимит = 0 Тогда
		Лимит = Константы.ЛимитКоличестваЗаказовКОтмене.Получить();
	КонецеСли;	
	
	
	Если Лимит <> 0 Тогда
		Если Заказы.Количество() >= Лимит Тогда
			МасП = Новый Массив;
			//МасП.Добавить("npv@strizh-logistic.ru");
			МасП.Добавить("evgeniy.marochkin@strizh-logistic.ru");
			
			Стр = "Количество к отмене = " + Строка(Заказы.Количество()) + ", лимит = " + Строка(Лимит);
			
			lem.ОтправитьСообщение(МасП, "Количество заказов к отмене превысило критическую массу. Отмена не будет произведена. (" + ?(Контрагент.Пустая(), "", СокрЛП(Контрагент.Наименование)) + ")", Стр, , "Логистическая компания ""Стриж""") ;		
			
			Возврат;
		КонецеСли;
	конецеСли;	
	
	
	ЗапИсключения = Новый Запрос;
	ЗапИсключения.Текст ="ВЫБРАТЬ
	                     |	СведенияДляОтменыАвтоматическогоУдаленияЗаказов003.Заказ,
	                     |	новаМестнаяДоставка.Ссылка КАК Доставка
	                     |ИЗ
	                     |	РегистрСведений.СведенияДляОтменыАвтоматическогоУдаленияЗаказов003 КАК СведенияДляОтменыАвтоматическогоУдаленияЗаказов003
	                     |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	                     |		ПО СведенияДляОтменыАвтоматическогоУдаленияЗаказов003.Заказ.Номер = новаМестнаяДоставка.Номер";
	РезИсключения = ЗапИсключения.Выполнить().Выгрузить();
	
	Соединение = Евген.СоздатьПодключениеКИнтернетМагазину();
	Мас = Новый Массив;
	Для Каждого Тек Из Заказы Цикл
		Если РезИсключения.Найти(Тек.Заказ) = Неопределено Тогда
			Мас.Добавить(Тек.Заказ);
		КонецеСли;	
	КонецЦикла;	
	
	МасСс = НайтиПоСсылкам(Мас);
	
	Движения.ДоставкиКУдалению003.Записывать = Истина;
	Движения.ДоставкиКУдалению003.Очистить();
	
	НачатьТранзакцию();
	Если РежимСнятияСДоставки = Перечисления.РежимыОбработкиНеПриехавшиэхЗаказов003.УдалятьСДоставки Тогда
		Для Каждого Тек Из МасСс Цикл
			Если ТипЗнч(Тек.Данные) = Тип("ЗадачаСсылка.новаЗадачаМестнойДоставки") Тогда
				Об = Тек.Данные.ПолучитьОбъект();
				Об.Удалить();
			КонецеСли;	
			Если ТипЗнч(Тек.Данные) = Тип("БизнесПроцессСсылка.новаПланированиеМестнойДоставки") Тогда
				Об = Тек.Данные.ПолучитьОбъект();
				Об.Удалить();
			КонецеСли;	
		КонецЦикла;	
		Для Каждого Тек Из Заказы Цикл
			Если РезИсключения.Найти(Тек.Заказ) = Неопределено Тогда
				Об = Тек.Заказ.ПолучитьОбъект();
				Об.ДоставкаОтменена = Истина;
				Об.Записать();
			КонецеСли;	
		КонецЦикла;	
	Иначе
		Для Каждого Тек Из Заказы Цикл
			Если РезИсключения.Найти(Тек.Заказ) <> Неопределено Тогда
				Продолжить;
			КонецЕСли;
			
			Нов = Движения.ДоставкиКУдалению003.Добавить();
			Нов.Доставка = Тек.Заказ;
			Нов.ДатаУдаления = Тек.Заказ.Дата + (КоличествоДней - 1)*86400;
			Нов.Период = Дата;
			Нов.Контрагент = Контрагент;
			Заказ = Тек.Заказ.ПолучитьОбъект();
			Заказ.Дата = Тек.Заказ.Дата + КоличествоДней*86400;
			
			
			ЧН = Час(Заказ.ВремяОтправленияС);
			ЧК = Час(Заказ.ВремяОтправленияПо);
			
			МН = Минута(Заказ.ВремяОтправленияС);
			МК = Минута(Заказ.ВремяОтправленияПо);
			
			ЧН_ = Час(Заказ.ВремяПрибытияС);
			ЧК_ = Час(Заказ.ВремяПрибытияПо);
			
			МН_ = Минута(Заказ.ВремяПрибытияС);
			МК_ = Минута(Заказ.ВремяПрибытияПо);
			
			
			Заказ.ВремяОтправленияС = Дата(Формат(Год(Заказ.Дата), "ЧГ=") + Формат(Месяц(Заказ.Дата), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(Заказ.Дата), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧН, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МН, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			Заказ.ВремяОтправленияПо = Дата(Формат(Год(Заказ.Дата), "ЧГ=") + Формат(Месяц(Заказ.Дата), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(Заказ.Дата), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧК, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МК, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			
			Заказ.ВремяПрибытияС = Дата(Формат(Год(Заказ.Дата), "ЧГ=") + Формат(Месяц(Заказ.Дата), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(Заказ.Дата), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧН_, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МН_, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			Заказ.ВремяПрибытияПо = Дата(Формат(Год(Заказ.Дата), "ЧГ=") + Формат(Месяц(Заказ.Дата), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(Заказ.Дата), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧК_, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МК_, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			
			Заказ.Записать();
		КонецЦикла;	
	КонецеСли;
	Для Каждого Тек Из Заказы Цикл
		Если РезИсключения.Найти(Тек.Заказ) <> Неопределено Тогда
			Продолжить;
		КонецЕСли;
		
		Комм = "товар не пришёл со склада 003";
		ТекстЗапроса = "
		|DECLARE @t TSetOrderStatus
		|INSERT INTO @t ([orderID],[statusId],[who],[completeDate],serviceDC,comment, isRefusal, ReasonRefusal, deliveryPrice, payType) VALUES (" +
		СокрЛП(Тек.Заказ.Номер) +
		", 4, '" +
		ПараметрыСеанса.ТекущийПользователь + "', '"+
		Евген.ДатаВSQL(Тек.Заказ.Дата, Ложь)+"', "+
		0 + ",'" +
		СтрЗаменить(Комм, "'", """") + "', 0, '', null, null" +
		")
		|EXEC import_setOrderStatusFrom1C @t
		|";
		Евген.ЗапросКИнтернетМагазину(ТекстЗапроса, Соединение);
		
		
		СтрЗапроса = "EXEC import_setOrderStatusIDFrom1C " + Формат(Сокрлп(Тек.Заказ.Номер), "ЧГ=") + ",213,'снятие с планирования'";
		Если lem.СохранитьСтатус(Тек.Заказ, 213, Ссылка) Тогда
			Евген.ЗапросКИнтернетМагазину(СтрЗапроса, Соединение);
		КонецеСли;	
		
		
		СтрЗапроса = "EXEC import_setOrderStatusIDFrom1C " + Формат(Сокрлп(Тек.Заказ.Номер), "ЧГ=") + ",401,'снятие с планирования'";
		Если lem.СохранитьСтатус(Тек.Заказ, 401, Ссылка) Тогда
			Евген.ЗапросКИнтернетМагазину(СтрЗапроса, Соединение);
		КонецеСли;	
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если РежимСнятияСДоставки = Перечисления.РежимыОбработкиНеПриехавшиэхЗаказов003.ОтложенноеУдаление Тогда
		Для Каждого Тек Из Заказы Цикл
			Заказ = Тек.Заказ.ПолучитьОбъект();
			Заказ.Дата = Тек.Заказ.Дата - КоличествоДней*86400;
			
			
			ЧН = Час(Заказ.ВремяОтправленияС);
			ЧК = Час(Заказ.ВремяОтправленияПо);
			
			МН = Минута(Заказ.ВремяОтправленияС);
			МК = Минута(Заказ.ВремяОтправленияПо);
			
			ЧН_ = Час(Заказ.ВремяПрибытияС);
			ЧК_ = Час(Заказ.ВремяПрибытияПо);
			
			МН_ = Минута(Заказ.ВремяПрибытияС);
			МК_ = Минута(Заказ.ВремяПрибытияПо);
			
			
			Заказ.ВремяОтправленияС = Дата(Формат(Год(Заказ.Дата), "ЧГ=") + Формат(Месяц(Заказ.Дата), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(Заказ.Дата), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧН, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МН, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			Заказ.ВремяОтправленияПо = Дата(Формат(Год(Заказ.Дата), "ЧГ=") + Формат(Месяц(Заказ.Дата), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(Заказ.Дата), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧК, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МК, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			
			Заказ.ВремяПрибытияС = Дата(Формат(Год(Заказ.Дата), "ЧГ=") + Формат(Месяц(Заказ.Дата), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(Заказ.Дата), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧН_, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МН_, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			Заказ.ВремяПрибытияПо = Дата(Формат(Год(Заказ.Дата), "ЧГ=") + Формат(Месяц(Заказ.Дата), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(Заказ.Дата), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧК_, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МК_, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			
			Заказ.Записать();
		КонецЦикла;	
	КонецеСли;
КонецПроцедуры
